package dwo.scripts.npc;

/**
 * L2GOD Team
 * User: ANZO
 * Date: 02.07.12
 * Time: 12:44
 */

import dwo.config.Config;
import dwo.gameserver.model.actor.L2Npc;
import dwo.gameserver.model.actor.instance.L2MonsterInstance;
import dwo.gameserver.model.actor.instance.L2PcInstance;
import dwo.gameserver.model.items.base.proptypes.ProcessType;
import dwo.gameserver.util.Rnd;

/**
 http://l2central.info/articles/items/327-goddess-of-destruction-chapter-2-tauti-cunduki-cokrovishh

 Встречающиеся в зонах охоты «Сундуки с Сокровищами» заменены на «Сундуки с Сокровищами Пространства».
 - С помощью «Сундуков с Сокровищами Пространства» можно получить более ценное вознаграждение, чем с помощью прежних «Сундуков с Сокровищами».
 - Наградные предметы, которые можно получить с помощью «Сундуков с Сокровищами Пространства», отличаются в зависимости от уровня зоны охоты.

 Порядок получения наградных предметов с помощью «Сундуков с Сокровищами Пространства» следующий.
 - Вступив в диалог с «Сундуком с Сокровищами Пространства», призываются «Пространственные Врата», прохождение через которые перемещает во временную игровую зону «Фантом-привратник Ада Бергамо».
 - Вступив в диалог с Бергамо, призываются три сундука с сокровищами, выбрав один из которых можно получить награду.
 - Призванный в комнату Бергамо NPC «Сундук Бергамо», это неагрессивный монстр, убить которого можно одной атакой или «Октон-Бомбой». Охотясь на него, можно получить различные настойки.

 «Пространственные Врата» материализуются на 3 минуты.
 Временная зона «Комната Бергамо» существует 3 минуты после входа в нее и вмещает одновременно не более 14 игроков.
 */

public class DimensionalChests
{
	private static final int[] Сундуки = {
		33699, 33700, 33701, 33702
	};

	private static final int ПространственныеВрата = 33691;

	// TODO: Новые координаты сундуков
	/**
	 * Orbis Temple:
	 * 33701, 217077, 48639, -15028, 33465
	 */
	private static final int[][] SPAWNLIST = {
		{18265, -45903, 204147, -3719, 36845}, {18265, -46840, 208116, -3479, 365},
		{18265, -44879, 210821, -3359, 36224}, {18265, -51869, 143919, -2888, 43668},
		{18265, -56540, 140357, -2624, 46000}, {18265, -54581, 136542, -2744, 5151},
		{18265, -43858, 117943, -3547, 42031}, {18265, -46213, 110566, -3805, 46258},
		{18265, -53080, 110423, -3568, 13063}, {18266, -96533, 102680, -3492, 31258},
		{18266, -98633, 108321, -3500, 11512}, {18266, -27521, 106384, -3710, 35426},
		{18266, -27792, 111223, -3685, 19669}, {18266, -27282, 117652, -3719, 3992},
		{18266, -19562, 138825, -3890, 18168}, {18266, -23256, 144122, -3866, 25959},
		{18266, -21411, 150031, -3026, 9624}, {18267, -93274, 108878, -3870, 24529},
		{18267, -96668, 113161, -3654, 24288}, {18267, -100435, 108889, -3477, 41466},
		{18267, 14, 178607, -3694, 41057}, {18267, 504, 170547, -3342, 56123}, {18267, 634, 164997, -3383, 44947},
		{18267, 51656, 150916, -2411, 54660}, {18267, 52174, 144991, -2923, 45688},
		{18267, 46651, 141367, -3257, 30227}, {18268, -90593, 114484, -3547, 26311},
		{18268, -95968, 116449, -3330, 31040}, {18268, -59739, 186067, -4807, 45695},
		{18268, -57793, 181483, -4805, 2808}, {18268, -12145, 178496, -4123, 30357},
		{18268, -16213, 175165, -3501, 33268}, {18268, -20435, 177664, -4200, 12730},
		{18269, -21426, 183313, -4039, 17895}, {18269, -27096, 183140, -4341, 42314},
		{18269, -43806, 190623, -3249, 9851}, {18269, -38201, 196087, -3212, 3994},
		{18269, -33657, 198337, -3622, 63186}, {18270, -15605, 188819, -4214, 19820},
		{18270, -20861, 191485, -4117, 21747}, {18270, -20344, 196512, -4203, 18410},
		{18271, 67711, 115108, -3578, 45488}, {18271, 74731, 97979, -3470, 55965}, {18271, 81623, 97903, -3581, 64185},
		{18271, 89331, 99488, -3455, 3641}, {18271, 95918, 101896, -3259, 1321}, {18272, 65130, 35688, -3749, 37260},
		{18272, 12782, 119776, -12082, 33021}, {18272, 11705, 117590, -12085, 16229},
		{18272, 23588, 111193, -9050, 10467}, {18272, 138722, 76225, -3292, 38609},
		{18272, 136162, 73365, -3639, 49589}, {18273, 137100, 10071, -4012, 35779}, {18273, 132759, 7149, -4312, 47159},
		{18273, 139172, 990, -4505, 56261}, {18273, 144872, 86067, -3634, 12715}, {18273, 146161, 89014, -3608, 13610},
		{18273, 144292, 93074, -3548, 24530}, {18274, 83567, 255932, -10355, 65064},
		{18274, 87474, 250279, -9849, 48630}, {18274, 81770, 246157, -9331, 58389},
		{18275, 164087, 18905, -3514, 33895}, {18275, 166683, 15630, -3332, 61426}, {18275, 162849, 8426, -3642, 36309},
		{18276, 151761, 63196, -3376, 14212}, {18276, 156736, 67716, -3496, 7691}, {18276, 162956, 74359, -3015, 5428},
		{18277, 166716, 54476, -4165, 51424}, {18277, 165736, 43381, -3534, 43888},
		{18277, 176794, -23075, -3443, 52984}, {18277, 185279, -25119, -2378, 58656},
		{18278, 115826, 14639, -5102, 55390}, {18278, 115134, 17532, -3611, 17302},
		{18278, 115049, 17334, -2119, 30982}, {18279, 115760, 16659, -639, 63272}, {18279, 113745, 16496, 930, 25242},
		{18279, 172421, -14934, -3050, 35348}, {18280, 115426, 15176, 1955, 48239}, {18280, 80632, -91846, -3122, 689},
		{18280, 90897, -91384, -2822, 60104}, {18280, 49955, -43276, -2626, 7473}, {18280, 48917, -36348, -1433, 17618},
		{18281, 51471, -41425, -2440, 50073}, {18281, 56051, -46875, -3038, 6114}, {18281, 113265, 14329, 2955, 43907},
		{18282, 112350, 17244, 3965, 15066}, {18282, 46651, -40015, -2043, 24165}, {18282, 48365, -35627, -1494, 7443},
		{18283, 112567, 15643, 4985, 16075}, {18283, 147842, -14792, -4382, 36785},
		{18283, 143415, -19326, -3170, 32008}, {18282, 140890, -10843, -4628, 15981},
		{18284, 144790, -87222, -4867, 55174}, {18284, 137241, -87039, -4151, 32023},
		{18284, 128527, -45099, -3286, 46395}, {18284, 118906, -42011, -3080, 26430},
		{18284, 190421, 61721, -6095, 65379}, {18284, 187811, 60710, -7232, 37749},
		{18284, 182730, 60864, -7231, 64892}, {18285, 86814, 79551, -3478, 45074}, {18285, 84506, 73991, -3606, 49827},
		{18285, 87572, 64215, -3692, 57290}, {18285, 81216, 112100, -3648, 54024}, {18285, 85169, 109026, -3158, 58863},
		{18285, 192110, 60885, -6105, 18182}, {18285, 114600, -49702, -2543, 39653},
		{18285, 156475, -78922, -4112, 58115}, {18286, 87201, 60435, -3519, 59275}, {18286, 92785, 63610, -3314, 10046},
		{18286, 144590, 114645, -3710, 5289}, {18286, 153680, 118806, -3795, 59560},
		{18286, 77553, 213362, -3757, 8557}, {18286, 86212, 221717, -3584, 3099}, {18286, 94587, 218811, -3712, 58400},
		{18286, 46142, -91058, -2648, 64251}, {18286, 48309, -84246, -3025, 31963},
		{18286, 51036, -75952, -3413, 64220}, {18286, 87740, -44229, -4125, 26121}, {18286, 80641, -44538, -5126, 45208}
	};

	private static final int[][] DROPLIST_LEVEL = {
		// Npc id, dropId, min, max, chance 10000 = 1%

		// 52 уровень
		// Сундук с Сокровищами Судьбы
		{33703, 6571, 1, 1, 10000}, // Благословенный Свиток: Модифицировать Оружие (B)
		{33703, 947, 1, 1, 20000},  // Свиток: Модифицировать Оружие (B)
		{33703, 6572, 1, 1, 50000}, // Благословенный Свиток: Модифицировать Доспех (B)
		{33703, 948, 1, 1, 100000}, // Свиток: Модифицировать Доспех (B)
	};

	private static final int[] DROPLIST_GENERAL = {
		9546, // Руда Огня
		9547, // Руда Воды
		9548, // Руда Земли
		9549, // Руда Ветра
		9550, // Руда Тьмы
		9551, // Руда Святости
		9552, // Кристалл Огня
		9553, // Кристалл Воды
		9554, // Кристалл Земли
		9555, // Кристалл Ветра
		9556, // Кристалл Тьмы
		9557  // Кристалл Святости

	};

	/**
	 * Дропаем вещь из сундука при открытии (внутри инстанса)
	 * @param chest инстанс сундука
	 * @param caster игрок, открывший сундук
	 */
	private void makeDrop(L2Npc chest, L2PcInstance caster)
	{
		// Считаем дроп по уровню сундука
		for(int[] data : DROPLIST_LEVEL)
		{
			if(data[0] == chest.getNpcId())
			{
				if(Rnd.get(1000000) < data[4])
				{
					int count = Rnd.get(data[2], data[3]);
					if(count > 0)
					{
						if(Config.AUTO_LOOT && caster.getUseAutoLoot() || caster.isFlying())
						{
							caster.addItem(ProcessType.NPC, data[1], count, chest, true);
						}
						else
						{
							((L2MonsterInstance) chest).dropItem(caster, data[1], count);
						}
					}
				}
			}
		}
		// Считаем общий для всех сундуков дроп (аттрибуты)
		if(Config.AUTO_LOOT && caster.getUseAutoLoot() || caster.isFlying())
		{
			caster.addItem(ProcessType.NPC, DROPLIST_GENERAL[Rnd.get(0, 11)], 1, chest, true);
		}
		else
		{
			((L2MonsterInstance) chest).dropItem(caster, DROPLIST_GENERAL[Rnd.get(0, 11)], 1);
		}
	}
}